#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f6fcf3e9-778c-491e-8482-3773cd5a9ee5]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7288becc-cd99-4d6b-a994-e1b347bca160]
module.keycloak_dev.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5c6a2c53-bc74-4f6b-a273-7b7ea8edc89f]
module.keycloak_dev.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8715f942-34e8-47cd-baa2-58b95fcdff26]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=09bf6d82-3a63-431c-8425-faf78176c2f3]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c2ac05dc-7383-4ddf-8d74-1d06576d5e94]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a7cffed4-f8d5-470b-9c6b-9c9c4e14ac55]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f6b8061d-6338-43a5-a5b8-3719b5f0bc8e]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=68a2f533-ebae-4369-8773-e1a5d2a32306]
module.keycloak_dev.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e0c76ee3-5bcc-4d6c-b086-7fc605bcd4a5]
module.keycloak_dev.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1edd6eee-c017-49f3-8c9c-d77af81fd439]
module.keycloak_dev.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=062929af-d59e-49b0-9e0a-f646aa80cc74]
module.keycloak_dev.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e4bee5c3-2071-4e8a-9978-406b995de4bd]
module.keycloak_dev.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a523b37b-eca6-4562-9403-4605d63571a7]
module.keycloak_dev.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=afcd2474-0353-44cb-b5c4-39e4de8c5598]
module.keycloak_dev.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=04a6414c-2513-4833-9d08-c25c662c9daa]
module.keycloak_dev.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b9309558-1291-44fe-a0e4-d78aeb6c25c9]
module.keycloak_dev.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0589962d-173d-4770-a497-cdb72c488266]
module.keycloak_dev.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=414580c7-4ea8-43cd-882c-265ea6f990b9]
module.keycloak_dev.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ec5bb8e0-d9d2-4016-b07d-efaa920b9b0c]
module.keycloak_dev.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=9ddcb15e-e415-4fdd-9288-d8c8f090fa8a]
module.keycloak_dev.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7bf5a529-7614-49cf-a235-48d7974fe5e2]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=841821f9-723c-47bb-a56c-91785f1fade6]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d24ad71d-4a12-4c7c-abd0-45d51729bb9e]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=18ac95f7-15d8-426d-a2f8-74aef2c9833a]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=202223a0-a71a-43df-b86e-d8a0e19603b6]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b5b248c8-6436-4bf4-9ccb-6f4c98a9f3f3]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a3dd3dbe-84af-41aa-aa94-15eb4d4d7dbb]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7a9e79da-e1da-4dfd-a7d7-336cdefe91a1]
module.keycloak_dev.module.onestopauth.module.client_hhjgfj-3071.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=69fc5334-7b05-4b4e-8f21-37b1d2ea312b]
module.keycloak_dev.module.onestopauth.module.client_hhjgfj-3071.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=dbbc8eba-b19a-42b5-88c0-53c020fe876a]
module.keycloak_dev.module.onestopauth.module.client_hhjgfj-3071.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=83145411-1421-45a8-9a3f-bdc48d7c7ece]
module.keycloak_dev.module.onestopauth.module.client_hhjgfj-3071.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=bf707d20-1fe5-4053-8138-675d42f18303]
module.keycloak_dev.module.onestopauth.module.client_hhjgfj-3071.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9e74f8cc-3fc7-4870-be81-238756e7456d]
module.keycloak_dev.module.onestopauth.module.client_hhjgfj-3071.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=dba6e15d-edc4-4b00-b8f7-f561479c409f]
module.keycloak_dev.module.onestopauth.module.client_hhjgfj-3071.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=cbba5603-ccbe-4bef-8fea-9eb5069554f5]
module.keycloak_dev.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ae3b8bb9-5ce2-462a-827a-bf7f3bb2556b]
module.keycloak_dev.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2334c28a-3c4a-42f2-8731-e11176754253]
module.keycloak_dev.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=511f47e4-832b-4b91-a145-5f2ef547fc90]
module.keycloak_dev.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=037b8cf6-6cc9-4f97-87ff-8e85e4d92193]
module.keycloak_dev.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c588df82-b227-4530-981a-e0b9a2c596e1]
module.keycloak_dev.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a892de72-c1a4-40a4-89bf-e88adea723f2]
module.keycloak_dev.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4c87fd52-363c-4af8-88bb-81c11752a21a]
module.keycloak_dev.module.onestopauth.module.client_august-17-4-pm-2-600.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=62b31059-f120-4ef0-8a17-2c1371997acd]
module.keycloak_dev.module.onestopauth.module.client_august-17-4-pm-2-600.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a6fce39d-7104-4b10-9eb7-c619005a897d]
module.keycloak_dev.module.onestopauth.module.client_august-17-4-pm-2-600.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=5d42e67f-751b-4e5c-8d3c-a26827aa4f0c]
module.keycloak_dev.module.onestopauth.module.client_august-17-4-pm-2-600.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a0bd0233-20fa-4b71-b497-77eb3b04babf]
module.keycloak_dev.module.onestopauth.module.client_august-17-4-pm-2-600.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=15a4bad3-ced5-4ee7-b543-a3e597684547]
module.keycloak_dev.module.onestopauth.module.client_august-17-4-pm-2-600.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=41a349e0-512a-4604-9039-4cadd1afee11]
module.keycloak_dev.module.onestopauth.module.client_august-17-4-pm-2-600.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=eb8f666a-0cbd-4fd9-8a33-327dad68cdd2]
module.keycloak_dev.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4ca0e2aa-0c07-4c65-826a-5d4af73568a4]
module.keycloak_dev.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b89a4683-f78b-4f49-b43d-a3fb6de3b557]
module.keycloak_dev.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d6f06ed8-5a10-4b32-ad4e-00c0f21bac44]
module.keycloak_dev.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c3451018-ecd3-49e0-913f-45cd6a0fc341]
module.keycloak_dev.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cdacfd7f-d4cf-4b28-b5f8-3610d3b347a6]
module.keycloak_dev.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b6cb32b7-ff38-42d7-a36e-3ca3f0a70fc5]
module.keycloak_dev.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=33296c96-6e89-441f-8518-1872653046f3]
module.keycloak_dev.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=caaf14f5-6e9b-4142-9f2f-119ad0fac37b]
module.keycloak_dev.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=16114c49-375c-4629-abe5-55c7872d069a]
module.keycloak_dev.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9846f0a6-bf72-424b-a96c-016eeabcb25d]
module.keycloak_dev.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ca7c8587-cb91-4e3a-b2b2-a38c096092ef]
module.keycloak_dev.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7f371c35-b184-435e-8750-3a4c551754bd]
module.keycloak_dev.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=fddcc4fc-b5bd-407c-9018-4e8348a278ea]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c9eaf799-089e-4c0a-aa22-8f13b61591c4]
module.keycloak_dev.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c208284e-eac3-40a8-9891-766378a7b63b]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ce475809-4d67-4814-b5cc-a79e02daae50]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ad0f24f5-94ad-47d9-90a3-e9c280a6637b]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b14318d7-2fef-448d-a616-2379a8be02d4]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2e998904-774d-48f6-a932-19867e13e464]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2a0d3020-53e5-4125-8c8f-9ccc07f16046]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=95edc824-5533-47ea-9224-6997adf57152]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=21530d66-47a3-4278-b106-a7fa54b4e22d]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=21bc362c-9a0a-4b70-8407-e2ff51ea58b7]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2da877d4-52d6-4030-a575-825bfc356689]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d8dc6a5d-5371-49e4-b9ea-3084c92be48b]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1a060418-f9b1-4147-8cf9-b61026f5a7cd]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e03d33e2-d02a-43eb-b8af-3b39322b8f1b]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7cfea54e-16cd-49ed-9b46-89c63915d19a]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0ea0dbdb-f06f-48e5-98cd-a4c145cb135a]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b29956ba-4dd8-43b6-990a-e2a81528b92d]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2a594a06-15d5-4d7c-9fce-8248ab7259ff]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b02dc5ec-a1b7-4c26-8e2f-2e41b8f3ffe4]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e29049d5-4b73-4393-8317-3d6345954adb]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ef330158-03fc-4eab-8631-5e3297e13e43]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=56200527-3909-4c02-b468-5f91156755fc]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=75d8ac36-8156-47d3-b890-97682124dc7c]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=383fe8ea-de3a-4915-a52f-860fbf1bbe80]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c2e2e710-9f0a-4d10-a63a-3d9926aa5548]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=32531f90-040c-44e8-a3cf-5438b59d6ef9]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8b99af0f-993e-46c3-8341-74e3124343db]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=97184e33-5413-40f5-9404-65ea2afca6c9]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=71146a13-fb16-4606-9d00-a7e021036455]
module.keycloak_dev.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8c801a7a-fbf6-4127-a5b3-1f89f5b26c05]
module.keycloak_dev.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=68ed2201-cb2c-48be-8bc9-c0937693dc0c]
module.keycloak_dev.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d4f514b1-c336-4b87-b52f-a6332cc9fe55]
module.keycloak_dev.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ec9c89b1-a50c-4436-93ce-2a9269a8d727]
module.keycloak_dev.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5f21918d-989f-43d5-b5b7-19b02854476a]
module.keycloak_dev.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5a2e3188-50f1-40b6-b758-7f623344fd9b]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=cf046218-5d2d-4ed0-9eb5-3e429509882a]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6faae13d-1853-4137-a10c-4c8cd7e98719]
module.keycloak_dev.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4ca2dc6b-a930-48c3-8c6f-e93edc3bbbb6]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=462c309a-1e1e-49f9-ad15-0dca06081da5]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0cd6a6d4-be26-4643-b2dc-a05bb0841e98]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1294a75a-f919-443a-b6c4-21aec8df64f3]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0a74c851-8d61-4c6f-a9cb-c391aae49297]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=893bcbd7-ec2b-45eb-8359-43eea32080ac]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9c526bb9-bfb4-4911-9563-d307eeb8561b]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=58c3abf5-274a-4d78-ba65-805228c03c6e]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=916ee66d-a8b5-4245-a017-de284fc24705]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5486d873-9227-4f7f-90c7-fb55af354dc0]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1c284bce-00b0-4fb2-a91d-6f074538b0a2]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9b502c1a-c266-4e70-8c61-bd149a822bb0]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c4b0139d-00aa-4243-8f42-9498401e1501]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0055cedc-4a82-4b56-91a0-ee9c2a32bd3c]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f8220213-5d69-45ec-ab15-e1070dbf1305]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8025e9f6-2fe6-4037-b4f0-584658f1e2f7]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=234f7f2d-0968-4059-82ed-099e0dd2e3fe]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=958158a6-eb69-4efd-b102-80265d62e24a]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3cafb241-d313-4358-82e6-d869c4709766]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f98c02aa-f7f3-40fa-a161-ccabeb75dedd]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ea90df44-6f29-4da4-b3f0-b7cf51b2f87d]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9324b99a-fbf3-473d-b34d-e56d786848aa]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=157c5fc1-4957-4134-855a-e94e8d60f2d8]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3928016b-9993-4ae4-8f5a-f2c988710f6b]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2b0a92d5-c80d-405d-806d-395d38edf809]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5f2e7cb5-4203-45e8-97bf-26e62a071753]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=edb9b7eb-a870-42b6-8fcb-ce214e846d92]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=7ad5bf86-606e-44c0-b602-e3d26dd378e0]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b0da9850-619f-4388-b419-c35dc71d8646]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f13c5a82-e594-4403-a728-c6bddd2681ba]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=916cc6a4-7729-45e4-a74b-618aaa83d18a]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2ef72e58-6423-4d3d-b500-5616b969fe5d]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6058e278-c6cb-47dd-881c-4d7c9b2dd1df]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cef6c1e2-d907-4fa7-8168-81c7930f3eb2]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=14c65911-9b02-4bf5-8723-7555e8425c38]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b1fb3a12-bd49-4b35-90ff-3894904dd0f8]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ede2ef2f-0db7-4163-91d9-893300e3a68a]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=341d12dd-9534-42eb-9f1b-e97ab0283cf4]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=4f1c1da5-e690-46f5-996c-ed13c15a4a52]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5cd65f11-28ca-4761-9372-aa0514719b43]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1a95fbf4-d7e6-4510-85ea-1eddf4f7763b]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=156bc55b-210e-4f01-a713-0e6c11cf0361]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1ddb02b8-f198-4775-8c88-a72eace09720]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=81776136-87a7-49cc-8414-b47235b1ff03]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f8ee461d-80a8-4027-a8dd-07573e4d4b35]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8f0198fb-0455-4811-820c-80e74acf4e7c]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7caeb33f-4332-4959-84aa-4a8fc39d3cf7]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=968ff5f0-ec51-44c6-9fbc-bfa5b12d7710]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b379ada4-dfdd-42f4-818c-2ec3a92ad4a0]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0e86d674-6b15-43ad-9a59-4ed67e5716c1]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=88561a69-cd7d-4381-a942-2422f0d02936]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bc7f6a47-0e3a-4f2f-9921-1d908e2277c2]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=583325d5-1108-4dc3-a278-a11dfb024c27]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=14a63c25-5444-4943-8bfa-53520c4e2861]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=54e80cc7-ebf7-48b0-880e-efa628c7ee70]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=27c1b1b9-40a9-48fc-8769-dc904bc3a145]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2eec2798-ebef-43da-9215-caf48e5b2f65]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9fa72992-16bb-425d-a6ce-73d88f71931a]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=391af413-2e3b-4c5a-b29a-1e2bfdf536cf]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=60cf3621-874e-4ef2-9637-5c48ce107e20]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=54045bf5-9c16-41df-87aa-6cf149ecf5ea]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=723cc968-2a88-4e28-b0ac-c277498734c7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3268.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "zz-3268"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3268.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3268.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3268.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3268.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "zz-3268"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3268.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3268.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3268.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "zz-3268"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "zz-3268"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://.",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3268.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "zz-3268"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3268.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3268.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3268.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3268.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "zz-3268"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3268.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3268.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3268.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "zz-3268"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "zz-3268"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://.",
        ]
    }

Plan: 16 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3040 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*